x,y = input("輸入月租費形式與通話時間:").split(',');x=int(x);y=int(y)
if x == 186:
    if y*0.09 <= 186:
        print("通話費為:186")
    elif 186 < y*0.09 <= 372:
        print("通話費為:%.0f" % (y*0.09*0.9))
    elif 372 < y*0.09:
        print("通話費為:%.0f" % (y*0.09*0.8))
if x == 386:
    if y*0.08 <= 386:
        print("通話費為:386")
    elif 386 < y*0.08 <= 772:
        print("通話費為:%.0f" % (y*0.08*0.8))
    elif 772 < y*0.08:
        print("通話費為:%.0f" % (y*0.08*0.7))
if x == 586:
    if y*0.07 <= 586:
        print("通話費為:586")
    elif 586 < y*0.07 <= 1172:
        print("通話費為:%.0f" % (y*0.07*0.7))
    elif 1172 < y*0.07:
        print("通話費為:%.0f" % (y*0.07*0.6))
if x == 986:
    if y*0.06 <= 986:
        print("通話費為:986")
    elif 986 < y*0.06 <= 1972:
        print("通話費為:%.0f" % (y*0.06*0.6))
    elif 1972 < y*0.06:
        print("通話費為:%.0f" % (y*0.06*0.5))